Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкаВопросовДляСобеседования/НастройкаВопросовДляСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаВопросовДляСобеседования</name>
  <resources>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭлементарныйВопросВопросаДляСобеседования</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНаВопросВопросаДляСобеседования</name>
    <type>
      <types>CatalogRef.ВариантыОтветовАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Вакансии</types>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВопросДляСобеседования</name>
    <type>
      <types>CatalogRef.ВопросыДляСобеседования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементарныйВопрос</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветНаВопрос</name>
    <type>
      <types>CatalogRef.ВариантыОтветовАнкет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПерсонала</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеХарактеристики</name>
    <type>
      <types>CatalogRef.ЗначенияХарактеристикПерсонала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкаВопросовДляСобеседования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПодразделение(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаВопросовДляСобеседования.Объект КАК Объект
		|ПОМЕСТИТЬ ВТОбъекты
		|ИЗ
		|	РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|ГДЕ
		|	НастройкаВопросовДляСобеседования.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	И НастройкаВопросовДляСобеседования.Объект.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Объекты.Объект КАК Объект
		|ИЗ
		|	ВТОбъекты КАК Объекты";
	РезультатЗапроса = Запрос.Выполнить();
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Объекты", РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Объект"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкаВопросовДляСобеседования.Объект.Подразделение КАК Подразделение,
		|	НастройкаВопросовДляСобеседования.Объект КАК Объект,
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.ОтветНаВопрос КАК ОтветНаВопрос,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.Балл КАК Балл,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопросВопросаДляСобеседования КАК ЭлементарныйВопросВопросаДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ОтветНаВопросВопросаДляСобеседования КАК ОтветНаВопросВопросаДляСобеседования
		|ИЗ
		|	РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|ГДЕ
		|	НастройкаВопросовДляСобеседования.Объект В(&Объекты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Объект") Цикл
		НаборЗаписей = РегистрыСведений.НастройкаВопросовДляСобеседования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
